[
    {
        "bg": "assets/bgprofile/braum.png",
        "splash": "assets/champ/Braum_0.jpg",
        "name": "Braum",
        "title": "The Heart of the Freljord",
        "lore": "Blessed with massive biceps and an even bigger heart, Braum is a beloved hero of the Freljord. Every mead hall north of Frostheld toasts his legendary strength, said to have felled a forest of oaks in a single night, and punched an entire mountain into rubble. Bearing an enchanted vault door as his shield, Braum roams the frozen north sporting a mustachioed smile as big as his muscles—a true friend to all those in need."
    
    },
    
    {
        "health": "610",
        "health-regen": "8.5",
        "armor": "47",
        "magic-resist": "32",
        "movement-speed": "335"
    },

    {
        "resource-name": "mana",
        "resource": "311",
        "resource-regen-name": "mana regen",
        "resource-regen": "6",
        "attack-damage": "55",
        "attack-speed": "0.644",
        "attack-range": "125"   
    },

    {
        "role-bg": "assets/role/sp.png",
        "role-icon": "assets/role/support.png",
        "role-name": "Warden",
        "role-desc": "Wardens are defensive tanks. Wardens stand steadfast, seeking to hold the line by persistently locking down any on-comers who try to pass them. Wardens keep their allies out of harm’s way and allow them to safely deal with enemies caught in the fray."
    },

    {   
        "p-name": "concussive blows",
        "p-desc": "Braum's basic attacks apply Concussive Blows. Once the first stack is applied, ally basic attacks also stack Concussive Blows. Upon reaching 4 stacks, the target is stunned and takes magic damage. For the next few seconds they cannot receive new stacks, but take bonus magic damage from Braum's attacks.",
        "p-icon": "assets/champ/braum/Ability/p.png",
        "p-vid": "assets/champ/braum/Ability/p.webm"
    },

    {
        "q-name": "winter's bite",
        "q-desc": "Braum propels freezing ice from his shield, slowing and dealing magic damage. Applies a stack of Concussive Blows.",
        "q-icon": "assets/champ/braum/Ability/q.png",
        "q-vid": "assets/champ/braum/Ability/q.webm"
    },

    {
        "w-name": "stand behind me",
        "w-desc": "Braum leaps to a target allied champion or minion. On arrival, Braum and the ally gain Armor and Magic Resist for a few seconds.",
        "w-icon": "assets/champ/braum/Ability/w.png",
        "w-vid": "assets/champ/braum/Ability/w.webm"
    },

    {
        "e-name": "unbreakable",
        "e-desc": "Braum raises his shield in a direction for several seconds, intercepting all projectiles causing them to hit him and be destroyed. He negates the damage of the first attack completely and reduces the damage of all subsequent attacks from this direction.",
        "e-icon": "assets/champ/braum/Ability/e.png",
        "e-vid": "assets/champ/braum/Ability/e.webm"
    },

    {
        "r-name": "glacial fissure",
        "r-desc": "Braum slams the ground, knocking up enemies nearby and in a line in front of him. A fissure is left along the line that slows enemies.",
        "r-icon": "assets/champ/braum/Ability/r.png",
        "r-vid": "assets/champ/braum/Ability/r.webm"
    }
]