[
    {
        "bg": "assets/bgprofile/graves.png",
        "splash": "assets/champ/Graves_0.jpg",
        "name": "Graves",
        "title": "The Outlaw",
        "lore": "Malcolm Graves is a renowned mercenary, gambler, and thief—a wanted man in every city and empire he has visited. Even though he has an explosive temper, he possesses a strict sense of criminal honor, often enforced at the business end of his double-barreled shotgun Destiny. In recent years, he has reconciled a troubled partnership with Twisted Fate, and together they have prospered once more in the turmoil of Bilgewater's criminal underbelly."
    
    },
    
    {
        "health": "625",
        "health-regen": "8",
        "armor": "33",
        "magic-resist": "32",
        "movement-speed": "340"
    },

    {
        "resource-name": "mana",
        "resource": "325",
        "resource-regen-name": "mana regen",
        "resource-regen": "8",
        "attack-damage": "68",
        "attack-speed": "0.475",
        "attack-range": "425"   
    },

    {
        "role-bg": "assets/role/mm.png",
        "role-icon": "assets/role/marksman.png",
        "role-name": "Specialist",
        "role-desc": "Specialists are a diverse group of champions who do not \"fit into a neat little box\" in regards to other class/subclass specifications. Specialists exhibit \"zone control\" either as a dominant or secondary attribute."
    },

    {   
        "p-name": "new destiny",
        "p-desc": "Graves' shotgun has some unique properties. He must reload when he runs out of ammo. Attacks fire 4 bullets, which cannot pass through units. Non-champions struck by multiple bullets are knocked back.",
        "p-icon": "assets/champ/graves/Ability/p.png",
        "p-vid": "assets/champ/graves/Ability/p.webm"
    },

    {
        "q-name": "end of the line",
        "q-desc": "Graves fires an explosive shell that detonates after 2 seconds, or 0.2 seconds if it strikes terrain.",
        "q-icon": "assets/champ/graves/Ability/q.png",
        "q-vid": "assets/champ/graves/Ability/q.webm"
    },

    {
        "w-name": "smoke screen",
        "w-desc": "Graves fires a smoke canister at the target area creating a cloud of smoke that reduces sight range. Enemies caught in the initial impact are dealt magic damage and have their Move Speed reduced briefly.",
        "w-icon": "assets/champ/graves/Ability/w.png",
        "w-vid": "assets/champ/graves/Ability/w.webm"
    },

    {
        "e-name": "quickdraw",
        "e-desc": "Graves dashes forward gaining an Armor boost for several seconds. If Graves dashes towards an enemy champion, gain two stacks of True Grit instead. Hitting enemies with basic attacks lowers the cooldown of this skill and refreshes the resistance boost.",
        "e-icon": "assets/champ/graves/Ability/e.png",
        "e-vid": "assets/champ/graves/Ability/e.webm"
    },

    {
        "r-name": "collateral damage",
        "r-desc": "Graves fires an explosive shell dealing heavy damage to the first champion it hits. After hitting a champion or reaching the end of its range, the shell explodes dealing damage in a cone.",
        "r-icon": "assets/champ/graves/Ability/r.png",
        "r-vid": "assets/champ/graves/Ability/r.webm"
    }
]
