[
    {
        "bg": "assets/bgprofile/khazix.png",
        "splash": "assets/champ/Khazix_0.jpg",
        "name": "Kha'Zix",
        "title": "The Voidreaver",
        "lore": "The Void grows, and the Void adapts—in none of its myriad spawn are these truths more apparent than Kha'Zix. Evolution drives the core of this mutating horror, born to survive and to slay the strong. Where it struggles to do so, it grows new, more effective ways to counter and kill its prey. Initially a mindless beast, Kha'Zix's intelligence has developed as much as its form. Now, the creature plans out its hunts, and even utilizes the visceral terror it engenders in its victims."
    
    },
    
    {
        "health": "643",
        "health-regen": "7.5",
        "armor": "36",
        "magic-resist": "32",
        "movement-speed": "350"
    },

    {
        "resource-name": "mana",
        "resource": "327",
        "resource-regen-name": "mana regen",
        "resource-regen": "7.59",
        "attack-damage": "60",
        "attack-speed": "0.668",
        "attack-range": "125"   
    },

    {
        "role-bg": "assets/role/as.png",
        "role-icon": "assets/role/assassin.png",
        "role-name": "Assassin",
        "role-desc": "Assassins specialize in infiltrating enemy lines with their unrivaled mobility to quickly dispatch high-priority targets. Due to their mostly melee nature, Assassins must put them themselves into dangerous positions in order to execute their targets. Luckily, they often have defensive tricks up their sleeves that, if used cleverly, allow them to effectively avoid incoming damage."
    },

    {   
        "p-name": "unseen threat",
        "p-desc": "Nearby enemies that are Isolated from their allies are marked. Kha'Zix's abilities have interactions with Isolated targets. When Kha'Zix is not visible to the enemy team, he gains Unseen Threat, causing his next basic attack against an enemy champion to deal bonus magic damage and slow them for a few seconds.",
        "p-icon": "assets/champ/khazix/Ability/p.png",
        "p-vid": "assets/champ/khazix/Ability/p.webm"
    },

    {
        "q-name": "taste their fear",
        "q-desc": "Deals physical damage to the target. Damage increased on Isolated targets. If he chooses to Evolve Reaper Claws, this refunds a percent of it's cooldown against Isolated targets. Kha'Zix also gains increased range on his basic attacks and Taste Their Fear.",
        "q-icon": "assets/champ/khazix/Ability/q.png",
        "q-vid": "assets/champ/khazix/Ability/q.webm"
    },

    {
        "w-name": "void spike",
        "w-desc": "Kha'Zix fires exploding spikes that deal physical damage to enemies hit. Kha'Zix is healed if he is also within the explosion radius. If he chooses to Evolve Spike Racks, Void Spike now fires three spikes in a cone, slow enemies hit, and reveals enemy champions hit for 2 seconds. Isolated targets are slowed for extra.",
        "w-icon": "assets/champ/khazix/Ability/w.png",
        "w-vid": "assets/champ/khazix/Ability/w.webm"
    },

    {
        "e-name": "leap",
        "e-desc": "Kha'Zix leaps to an area, dealing physical damage upon landing. If he chooses to Evolve Wings, Leap's range increases by 200 and the cooldown resets on champion kill or assist.",
        "e-icon": "assets/champ/khazix/Ability/e.png",
        "e-vid": "assets/champ/khazix/Ability/e.webm"
    },

    {
        "r-name": "void assault",
        "r-desc": "Each rank allows Kha'Zix to evolve one of his abilities, giving it a unique additional effect. When activated, Kha'Zix becomes Invisible, triggering Unseen Threat and increasing Move Speed. If he chooses to Evolve Adaptive Cloaking, Void Assault gains increased Invisibility duration, and an additional use.",
        "r-icon": "assets/champ/khazix/Ability/r.png",
        "r-vid": "assets/champ/khazix/Ability/r.webm"
    }
]
