[
    {
        "bg": "assets/bgprofile/leona.png",
        "splash": "assets/champ/Leona_0.jpg",
        "name": "Leona",
        "title": "The Radiant Dawn",
        "lore": "Imbued with the fire of the sun, Leona is a holy warrior of the Solari who defends Mount Targon with her Zenith Blade and the Shield of Daybreak. Her skin shimmers with starfire while her eyes burn with the power of the celestial Aspect within her. Armored in gold and bearing a terrible burden of ancient knowledge, Leona brings enlightenment to some, death to others."
    
    },
    
    {
        "health": "646",
        "health-regen": "8.5",
        "armor": "47",
        "magic-resist": "32",
        "movement-speed": "335"
    },

    {
        "resource-name": "mana",
        "resource": "302",
        "resource-regen-name": "mana regen",
        "resource-regen": "6",
        "attack-damage": "60",
        "attack-speed": "0.625",
        "attack-range": "125"   
    },

    {
        "role-bg": "assets/role/tk.png",
        "role-icon": "assets/role/tank.png",
        "role-name": "Vanguard",
        "role-desc": "Vanguards are offensive tanks. Vanguards lead the charge for their team and specialize at bringing the action. Their explosive team fight initiation seeks to catch enemies out of position while allowing allies to follow-up to devastating effect."
    },

    {   
        "p-name": "sunlight",
        "p-desc": "Damaging spells afflict enemies with Sunlight for 1.5 seconds. When allied Champions deal damage to those targets, they consume the Sunlight to deal additional magic damage.",
        "p-icon": "assets/champ/leona/Ability/p.png",
        "p-vid": "assets/champ/leona/Ability/p.webm"
    },

    {
        "q-name": "shield of daybreak",
        "q-desc": "Leona uses her shield to perform her next basic attack, dealing bonus magic damage and stunning the target.",
        "q-icon": "assets/champ/leona/Ability/q.png",
        "q-vid": "assets/champ/leona/Ability/q.webm"
    },

    {
        "w-name": "eclipse",
        "w-desc": "Leona raises her shield to gain Damage Reduction, Armor, and Magic Resist. When the duration first ends, if there are nearby enemies, she will deal magic damage to them and prolong the duration of the effect.",
        "w-icon": "assets/champ/leona/Ability/w.png",
        "w-vid": "assets/champ/leona/Ability/w.webm"
    },

    {
        "e-name": "zenith blade",
        "e-desc": "Leona projects a solar image of her sword, dealing magic damage to all enemies in a line. When the image fades, the last enemy champion struck will be briefly immobilized and Leona will dash to them.",
        "e-icon": "assets/champ/leona/Ability/e.png",
        "e-vid": "assets/champ/leona/Ability/e.webm"
    },

    {
        "r-name": "solar flare",
        "r-desc": "Leona calls down a beam of solar energy, dealing damage to enemies in an area. Enemies in the center of the area are stunned, while enemies on the outside are slowed.",
        "r-icon": "assets/champ/leona/Ability/r.png",
        "r-vid": "assets/champ/leona/Ability/r.webm"
    }
]