[
    {
        "bg": "assets/bgprofile/malphite.png",
        "splash": "assets/champ/Malphite_0.jpg",
        "name": "Malphite",
        "title": "Shard of the Monolith",
        "lore": "A massive creature of living stone, Malphite struggles to impose blessed order on a chaotic world. Birthed as a servitor-shard to an otherworldly obelisk known as the Monolith, he used his tremendous elemental strength to maintain and protect his progenitor, but ultimately failed. The only survivor of the destruction that followed, Malphite now endures Runeterra's soft folk and their fluid temperaments, while struggling to find a new role worthy of the last of his kind."
    
    },
    
    {
        "health": "644",
        "health-regen": "7",
        "armor": "37",
        "magic-resist": "28",
        "movement-speed": "335"
    },

    {
        "resource-name": "mana",
        "resource": "280",
        "resource-regen-name": "mana regen",
        "resource-regen": "7.3",
        "attack-damage": "62",
        "attack-speed": "0.736",
        "attack-range": "125"   
    },

    {
        "role-bg": "assets/role/tk.png",
        "role-icon": "assets/role/tank.png",
        "role-name": "Vanguard",
        "role-desc": "Vanguards are offensive tanks. Vanguards lead the charge for their team and specialize at bringing the action. Their explosive team fight initiation seeks to catch enemies out of position while allowing allies to follow-up to devastating effect."
    },

    {   
        "p-name": "granite shield",
        "p-desc": "Malphite is shielded by a layer of rock which absorbs damage up to 10% of his maximum Health. If Malphite has not been hit for a few seconds, this effect recharges.",
        "p-icon": "assets/champ/malphite/Ability/p.png",
        "p-vid": "assets/champ/malphite/Ability/p.webm"
    },

    {
        "q-name": "seismic shard",
        "q-desc": "Malphite sends a shard of the earth through the ground at his foe, dealing damage upon impact and stealing Move Speed for 3 seconds.",
        "q-icon": "assets/champ/malphite/Ability/q.png",
        "q-vid": "assets/champ/malphite/Ability/q.webm"
    },

    {
        "w-name": "thunderclap",
        "w-desc": "Malphite attacks with such force that it creates a sonic boom. For the next few seconds, his attacks create aftershocks in front of him.",
        "w-icon": "assets/champ/malphite/Ability/w.png",
        "w-vid": "assets/champ/malphite/Ability/w.webm"
    },

    {
        "e-name": "ground slam",
        "e-desc": "Malphite slams the ground, sending out a shockwave that deals magic damage based on his Armor and reduces the Attack Speed of enemies for a short duration.",
        "e-icon": "assets/champ/malphite/Ability/e.png",
        "e-vid": "assets/champ/malphite/Ability/e.webm"
    },

    {
        "r-name": "unstoppable force",
        "r-desc": "Malphite launches himself to a location at high speed, damaging enemies and knocking them into the air.",
        "r-icon": "assets/champ/malphite/Ability/r.png",
        "r-vid": "assets/champ/malphite/Ability/r.webm"
    }
]