[
    {
        "bg": "assets/bgprofile/rell.png",
        "splash": "assets/champ/Rell_0.jpg",
        "name": "Rell",
        "title": "The Iron Maiden",
        "lore": "The product of brutal experimentation at the hands of the Black Rose, Rell is a defiant, living weapon determined to topple Noxus. Her childhood was one of misery and horror, enduring unspeakable procedures to perfect and weaponize her magical control over metal... until she staged a violent escape, killing many of her captors in the process. Now branded as a criminal, Rell attacks Noxian soldiers on sight as she searches for survivors of her old “academy,” defending the meek while delivering violent death to her former overseers."
    
    },
    
    {
        "health": "610",
        "health-regen": "7.5",
        "armor": "36",
        "magic-resist": "30",
        "movement-speed": "330"
    },

    {
        "resource-name": "mana",
        "resource": "350",
        "resource-regen-name": "mana regen",
        "resource-regen": "6",
        "attack-damage": "55",
        "attack-speed": "0.625",
        "attack-range": "175"   
    },

    {
        "role-bg": "assets/role/tk.png",
        "role-icon": "assets/role/tank.png",
        "role-name": "Vanguard",
        "role-desc": "Vanguards are offensive tanks. Vanguards lead the charge for their team and specialize at bringing the action. Their explosive team fight initiation seeks to catch enemies out of position while allowing allies to follow-up to devastating effect."
    },

    {   
        "p-name": "break the mold",
        "p-desc": "Rell's Attacks and Abilities steal Armor and Magic Resist on hit.",
        "p-icon": "assets/champ/rell/Ability/p.png",
        "p-vid": "assets/champ/rell/Ability/p.webm"
    },

    {
        "q-name": "shattering strike",
        "q-desc": "Rell deals magic damage to units in a line, breaking their shields and stunning them.",
        "q-icon": "assets/champ/rell/Ability/q.png",
        "q-vid": "assets/champ/rell/Ability/q.webm"
    },

    {
        "w-name": "ferromancy: crash down",
        "w-desc": "Mounted: Rell Dismounts, crashing down in her armor, Knocking enemies up and gaining a large Shield. While dismounted, she gains Armor, Magic Resist, Attack Speed, and Attack Range, but is Slowed. Dismounted: Rell forms her Mount, gaining a burst of speed and Knocking Up the next enemy she attacks.",
        "w-icon": "assets/champ/rell/Ability/w.png",
        "w-vid": "assets/champ/rell/Ability/w.webm"
    },

    {
        "e-name": "full tilt",
        "e-desc": "Passive: Rell gains out of combat Move Speed. Active: Rell and an ally gain ramping Move Speed, doubled toward enemies and each other. Her next Attack explodes, dealing magic damage.",
        "e-icon": "assets/champ/rell/Ability/e.png",
        "e-vid": "assets/champ/rell/Ability/e.webm"
    },

    {
        "r-name": "magnet storm",
        "r-desc": "Rell explodes in a magnetic fury, violently Pulling nearby enemies toward herself. Then Rell constantly Drags nearby enemies toward herself for a short while, dealing magic damage over time.",
        "r-icon": "assets/champ/rell/Ability/r.png",
        "r-vid": "assets/champ/rell/Ability/r.webm"
    }
]