[
    {
        "bg": "assets/bgprofile/urgot.png",
        "splash": "assets/champ/Urgot_0.jpg",
        "name": "Urgot",
        "title": "The Dreadnought",
        "lore": "Once a powerful Noxian headsman, Urgot was betrayed by the empire for which he had killed so many. Bound in iron chains, he was forced to learn the true meaning of strength in the Dredge—a prison mine deep beneath Zaun. Emerging in a disaster that spread chaos throughout the city, he now casts an imposing shadow over its criminal underworld. Raising his victims on the very chains that once enslaved him, he will purge his new home of the unworthy, making it a crucible of pain."
    
    },
    
    {
        "health": "655",
        "health-regen": "7.5",
        "armor": "36",
        "magic-resist": "32",
        "movement-speed": "330"
    },

    {
        "resource-name": "mana",
        "resource": "340",
        "resource-regen-name": "mana regen",
        "resource-regen": "7.25",
        "attack-damage": "63",
        "attack-speed": "0.625",
        "attack-range": "350"   
    },

    {
        "role-bg": "assets/role/ft.png",
        "role-icon": "assets/role/fighter.png",
        "role-name": "Juggernaut",
        "role-desc": "Juggernauts are melee titans who relentlessly march down the opposition and devastate those foolish enough to get within their grasp. They are the only subclass who excel at both dealing and taking significant amounts of damage, but in turn they have a tough time closing in on targets due to their low range and extremely limited mobility."
    },

    {   
        "p-name": "echoing flames",
        "p-desc": "Urgot's basic attacks and Purge periodically trigger blasts of flame from his legs, dealing physical damage.",
        "p-icon": "assets/champ/urgot/Ability/p.png",
        "p-vid": "assets/champ/urgot/Ability/p.webm"
    },

    {
        "q-name": "corrosive charge",
        "q-desc": "Fires an explosive charge at the target location, dealing physical damage and slowing enemies caught in the explosion.",
        "q-icon": "assets/champ/urgot/Ability/q.png",
        "q-vid": "assets/champ/urgot/Ability/q.webm"
    },

    {
        "w-name": "purge",
        "w-desc": "Urgot slows himself while he unloads his weapon on nearby enemies. Prioritizes enemy champions Urgot has recently struck with other abilities and triggers Echoing Flames.",
        "w-icon": "assets/champ/urgot/Ability/w.png",
        "w-vid": "assets/champ/urgot/Ability/w.webm"
    },

    {
        "e-name": "disdain",
        "e-desc": "Urgot charges in a direction, shielding himself and trampling non-champion enemies. If he catches an enemy champion, he will stop and hurl them out of his way.",
        "e-icon": "assets/champ/urgot/Ability/e.png",
        "e-vid": "assets/champ/urgot/Ability/e.webm"
    },

    {
        "r-name": "fear beyond death",
        "r-desc": "Urgot fires a chem-drill that impales the first enemy champion hit. If that champion falls below a health threshold, Urgot judges them weak and can execute them.",
        "r-icon": "assets/champ/urgot/Ability/r.png",
        "r-vid": "assets/champ/urgot/Ability/r.webm"
    }
]