[
    {
        "bg": "assets/bgprofile/veigar.png",
        "splash": "assets/champ/Veigar_0.jpg",
        "name": "Veigar",
        "title": "The Tiny Master of Evil",
        "lore": "An enthusiastic master of dark sorcery, Veigar has embraced powers that few mortals dare approach. As a free-spirited inhabitant of Bandle City, he longed to push beyond the limitations of yordle magic, and turned instead to arcane texts that had been hidden away for thousands of years. Now a stubborn creature with an endless fascination for the mysteries of the universe, Veigar is often underestimated by others—but even though he believes himself truly evil, he possesses an inner morality that leads some to question his deeper motivations."
    
    },
    
    {
        "health": "550",
        "health-regen": "6.5",
        "armor": "18",
        "magic-resist": "32",
        "movement-speed": "340"
    },

    {
        "resource-name": "mana",
        "resource": "490",
        "resource-regen-name": "mana regen",
        "resource-regen": "8",
        "attack-damage": "52",
        "attack-speed": "0.625",
        "attack-range": "550"   
    },

    {
        "role-bg": "assets/role/mg.png",
        "role-icon": "assets/role/mage.png",
        "role-name": "Burst Mage",
        "role-desc": "Burst Mages aim to single out vulnerable targets by locking them down and following up with a devastating barrage of damage from range. They are strongest when using their full suite of spells executed perfectly to maximum effect, and most vulnerable when they cannot deliver."
    },

    {   
        "p-name": "phenomenon evil power",
        "p-desc": "Veigar is the greatest Evil to ever strike at the hearts of Runeterra - and he's only getting bigger! Striking an enemy Champion with a spell or scoring a takedown grants Veigar permanently increased Ability Power.",
        "p-icon": "assets/champ/veigar/Ability/p.png",
        "p-vid": "assets/champ/veigar/Ability/p.webm"
    },

    {
        "q-name": "baleful strike",
        "q-desc": "Veigar unleashes a bolt of dark energy that deals magic damage to the first two enemies hit. Units killed by this bolt grant Veigar some ability power permanently.",
        "q-icon": "assets/champ/veigar/Ability/q.png",
        "q-vid": "assets/champ/veigar/Ability/q.webm"
    },

    {
        "w-name": "dark matter",
        "w-desc": "Veigar calls a great mass of dark matter to fall from the sky to the target location, dealing magic damage when it lands. Stacks of Phenomenal Evil reduce Dark Matter's cooldown.",
        "w-icon": "assets/champ/veigar/Ability/w.png",
        "w-vid": "assets/champ/veigar/Ability/w.webm"
    },

    {
        "e-name": "event horizon",
        "e-desc": "Veigar twists the edges of space, creating a cage that Stuns enemies that pass through.",
        "e-icon": "assets/champ/veigar/Ability/e.png",
        "e-vid": "assets/champ/veigar/Ability/e.webm"
    },

    {
        "r-name": "primordial burst",
        "r-desc": "Blasts target enemy champion, dealing a large amount of magic damage, increasing based on the target's missing health.",
        "r-icon": "assets/champ/veigar/Ability/r.png",
        "r-vid": "assets/champ/veigar/Ability/r.webm"
    }
]