[
    {
        "bg": "assets/bgprofile/zyra.png",
        "splash": "assets/champ/Zyra_0.jpg",
        "name": "Zyra",
        "title": "Rise of the Thorns",
        "lore": "Born in an ancient, sorcerous catastrophe, Zyra is the wrath of nature given form—an alluring hybrid of plant and human, kindling new life with every step. She views the many mortals of Valoran as little more than prey for her seeded progeny, and thinks nothing of slaying them with flurries of deadly spines. Though her true purpose has not been revealed, Zyra wanders the world, indulging her most primal urges to colonize, and strangle all other life from it."
    
    },
    
    {
        "health": "574",
        "health-regen": "5.5",
        "armor": "29",
        "magic-resist": "30",
        "movement-speed": "340"
    },

    {
        "resource-name": "mana",
        "resource": "418",
        "resource-regen-name": "mana regen",
        "resource-regen": "13",
        "attack-damage": "53",
        "attack-speed": "0.681",
        "attack-range": "575"   
    },

    {
        "role-bg": "assets/role/mg.png",
        "role-icon": "assets/role/mage.png",
        "role-name": "Catcher",
        "role-desc": "Catchers specialize in locking down opponents or, in some cases, entire battlefields by creating intense zones of threat that only foolish enemies would dare wade through. Although not as reliant on their friends as Enchanters, the fragile Catchers greatly benefit from allied presence - both to deter incoming danger and to help capitalize on targets they've locked down."
    },

    {   
        "p-name": "garden of thorns",
        "p-desc": "Seeds spawn around Zyra periodically, becoming faster with level. Zyra can cast Deadly Spines or Grasping Roots near seeds to grow plants, who fight for Zyra.",
        "p-icon": "assets/champ/zyra/Ability/p.png",
        "p-vid": "assets/champ/zyra/Ability/p.webm"
    },

    {
        "q-name": "deadly spines",
        "q-desc": "Thick vines spread through the ground and explode into spines, dealing magic damage to enemies within the area. If cast near a seed, Deadly Spines grows a Thorn Spitter plant, which fires at enemies from afar.",
        "q-icon": "assets/champ/zyra/Ability/q.png",
        "q-vid": "assets/champ/zyra/Ability/q.webm"
    },

    {
        "w-name": "rampant growth",
        "w-desc": "Zyra plants a seed, lasting up to 60 seconds. Deadly Spines and Grasping Roots cast near seeds will turn them into plants who fight for Zyra. Zyra can store multiple seeds at once, and killing enemies reduces Rampant Growth's recharge time.",
        "w-icon": "assets/champ/zyra/Ability/w.png",
        "w-vid": "assets/champ/zyra/Ability/w.webm"
    },

    {
        "e-name": "grasping roots",
        "e-desc": "Zyra sends forth vines through the ground to ensnare her target, dealing damage and rooting enemies they come across. If cast near a seed, Grasping Roots grows a Vine Lasher, whose short range attacks reduce enemy Move Speed.",
        "e-icon": "assets/champ/zyra/Ability/e.png",
        "e-vid": "assets/champ/zyra/Ability/e.webm"
    },

    {
        "r-name": "stranglethorns",
        "r-desc": "Zyra summons a twisted thicket at her target location, dealing damage to enemies as it expands and knocking them airborne as it contracts. Plants within the thicket are enraged.",
        "r-icon": "assets/champ/zyra/Ability/r.png",
        "r-vid": "assets/champ/zyra/Ability/r.webm"
    }
]